Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/NXP/K64FN1M0_FRDM_K64F/DeviceSupport/fsl_device_registers.h
    #define K21FA12_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK21FA12/MK21FA12.h"
    /* Extension register definitions */
    #include "device/MK21FA12/MK21FA12_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK21FA12/MK21FA12_features.h"

#elif (defined(CPU_MK22FN128VDC10) || defined(CPU_MK22FN128VLH10) || defined(CPU_MK22FN128VLL10) || \
    defined(CPU_MK22FN128VMP10))

    #define K22F12810_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK22F12810/MK22F12810.h"
    /* Extension register definitions */
    #include "device/MK22F12810/MK22F12810_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK22F12810/MK22F12810_features.h"

#elif (defined(CPU_MK22FN256CAH12) || defined(CPU_MK22FN128CAH12) || defined(CPU_MK22FN256VDC12) || \
    defined(CPU_MK22FN256VLH12) || defined(CPU_MK22FN256VLL12) || defined(CPU_MK22FN256VMP12))

    #define K22F25612_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK22F25612/MK22F25612.h"
    /* Extension register definitions */
    #include "device/MK22F25612/MK22F25612_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK22F25612/MK22F25612_features.h"

#elif (defined(CPU_MK22FN512CAP12) || defined(CPU_MK22FN512VDC12) || defined(CPU_MK22FN512VLH12) || \
    defined(CPU_MK22FN512VLL12) || defined(CPU_MK22FN512VMP12))

    #define K22F51212_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK22F51212/MK22F51212.h"
    /* Extension register definitions */
    #include "device/MK22F51212/MK22F51212_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK22F51212/MK22F51212_features.h"

#elif (defined(CPU_MK24FN1M0VDC12) || defined(CPU_MK24FN1M0VLL12) || defined(CPU_MK24FN1M0VLQ12))

    #define K24F12_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK24F12/MK24F12.h"
    /* Extension register definitions */
    #include "device/MK24F12/MK24F12_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK24F12/MK24F12_features.h"

#elif (defined(CPU_MK24FN256VDC12))

    #define K24F25612_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK24F25612/MK24F25612.h"
    /* Extension register definitions */
    #include "device/MK24F25612/MK24F25612_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK24F25612/MK24F25612_features.h"

#elif (defined(CPU_MK30DN512VLK10) || defined(CPU_MK30DN512VLL10) || defined(CPU_MK30DX128VLQ10) || \
    defined(CPU_MK30DX256VLQ10) || defined(CPU_MK30DN512VLQ10) || defined(CPU_MK30DN512VMC10) || \
    defined(CPU_MK30DX128VMD10) || defined(CPU_MK30DX256VMD10) || defined(CPU_MK30DN512VMD10))

    #define K30D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK30D10/MK30D10.h"
    /* Extension register definitions */
    #include "device/MK30D10/MK30D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK30D10/MK30D10_features.h"

#elif (defined(CPU_MK40DN512VLK10) || defined(CPU_MK40DN512VLL10) || defined(CPU_MK40DX128VLQ10) || \
    defined(CPU_MK40DX256VLQ10) || defined(CPU_MK40DN512VLQ10) || defined(CPU_MK40DN512VMC10) || \
    defined(CPU_MK40DX128VMD10) || defined(CPU_MK40DX256VMD10) || defined(CPU_MK40DN512VMD10))

    #define K40D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK40D10/MK40D10.h"
    /* Extension register definitions */
    #include "device/MK40D10/MK40D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK40D10/MK40D10_features.h"

#elif (defined(CPU_MK50DX256CLL10) || defined(CPU_MK50DN512CLL10) || defined(CPU_MK50DN512CLQ10) || \
    defined(CPU_MK50DX256CMC10) || defined(CPU_MK50DN512CMC10) || defined(CPU_MK50DN512CMD10) || \
    defined(CPU_MK50DX256CMD10) || defined(CPU_MK50DX256CLK10))

    #define K50D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK50D10/MK50D10.h"
    /* Extension register definitions */
    #include "device/MK50D10/MK50D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK50D10/MK50D10_features.h"

#elif (defined(CPU_MK51DX256CLL10) || defined(CPU_MK51DN512CLL10) || defined(CPU_MK51DN256CLQ10) || \
    defined(CPU_MK51DN512CLQ10) || defined(CPU_MK51DX256CMC10) || defined(CPU_MK51DN512CMC10) || \
    defined(CPU_MK51DN256CMD10) || defined(CPU_MK51DN512CMD10) || defined(CPU_MK51DX256CLK10))

    #define K51D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK51D10/MK51D10.h"
    /* Extension register definitions */
    #include "device/MK51D10/MK51D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK51D10/MK51D10_features.h"

#elif (defined(CPU_MK52DN512CLQ10) || defined(CPU_MK52DN512CMD10))

    #define K52D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK52D10/MK52D10.h"
    /* Extension register definitions */
    #include "device/MK52D10/MK52D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK52D10/MK52D10_features.h"

#elif (defined(CPU_MK53DN512CLQ10) || defined(CPU_MK53DX256CLQ10) || defined(CPU_MK53DN512CMD10) || \
    defined(CPU_MK53DX256CMD10))

    #define K53D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK53D10/MK53D10.h"
    /* Extension register definitions */
    #include "device/MK53D10/MK53D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK53D10/MK53D10_features.h"

#elif (defined(CPU_MK60DN256VLL10) || defined(CPU_MK60DX256VLL10) || defined(CPU_MK60DN512VLL10) || \
    defined(CPU_MK60DN256VLQ10) || defined(CPU_MK60DX256VLQ10) || defined(CPU_MK60DN512VLQ10) || \
    defined(CPU_MK60DN256VMC10) || defined(CPU_MK60DX256VMC10) || defined(CPU_MK60DN512VMC10) || \
    defined(CPU_MK60DN256VMD10) || defined(CPU_MK60DX256VMD10) || defined(CPU_MK60DN512VMD10))

