Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/NXP/K64FN1M0_FRDM_K64F/DeviceSupport/fsl_device_registers.h
    #define K60D10_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK60D10/MK60D10.h"
    /* Extension register definitions */
    #include "device/MK60D10/MK60D10_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK60D10/MK60D10_features.h"

#elif (defined(CPU_MK63FN1M0VLQ12) || defined(CPU_MK63FN1M0VMD12))

    #define K63F12_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK63F12/MK63F12.h"
    /* Extension register definitions */
    #include "device/MK63F12/MK63F12_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK63F12/MK63F12_features.h"

#elif (defined(CPU_MK64FX512VDC12) || defined(CPU_MK64FN1M0VDC12) || defined(CPU_MK64FX512VLL12) || \
    defined(CPU_MK64FN1M0VLL12) || defined(CPU_MK64FX512VLQ12) || defined(CPU_MK64FN1M0VLQ12) || \
    defined(CPU_MK64FX512VMD12) || defined(CPU_MK64FN1M0VMD12))

    #define K64F12_SERIES

    /* CMSIS-style register definitions */
    #include "MK64F12.h"
    /* Extension register definitions */
    #include "MK64F12_registers.h"
    /* CPU specific feature definitions */
    #include "MK64F12_features.h"

#elif (defined(CPU_MK65FN2M0CAC18) || defined(CPU_MK65FX1M0CAC18) || defined(CPU_MK65FN2M0VMI18) || \
    defined(CPU_MK65FX1M0VMI18))

    #define K65F18_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK65F18/MK65F18.h"
    /* Extension register definitions */
    #include "device/MK65F18/MK65F18_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK65F18/MK65F18_features.h"

#elif (defined(CPU_MK66FN2M0VLQ18) || defined(CPU_MK66FX1M0VLQ18) || defined(CPU_MK66FN2M0VMD18) || \
    defined(CPU_MK66FX1M0VMD18))

    #define K66F18_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK66F18/MK66F18.h"
    /* Extension register definitions */
    #include "device/MK66F18/MK66F18_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK66F18/MK66F18_features.h"

#elif (defined(CPU_MK70FN1M0VMJ12) || defined(CPU_MK70FX512VMJ12))

    #define K70F12_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK70F12/MK70F12.h"
    /* Extension register definitions */
    #include "device/MK70F12/MK70F12_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK70F12/MK70F12_features.h"

#elif (defined(CPU_MK70FN1M0VMJ15) || defined(CPU_MK70FX512VMJ15))

    #define K70F15_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK70F15/MK70F15.h"
    /* Extension register definitions */
    #include "device/MK70F15/MK70F15_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK70F15/MK70F15_features.h"

#elif (defined(CPU_MK80FN256VDC15))

    #define K80F25615_SERIES

    /* CMSIS-style register definitions */
    #include "device/MK80F25615/MK80F25615.h"
    /* Extension register definitions */
    #include "device/MK80F25615/MK80F25615_registers.h"
    /* CPU specific feature definitions */
    #include "device/MK80F25615/MK80F25615_features.h"

#elif (defined(CPU_MKE02Z64VLC2) || defined(CPU_MKE02Z32VLC2) || defined(CPU_MKE02Z16VLC2) || \
    defined(CPU_MKE02Z64VLD2) || defined(CPU_MKE02Z32VLD2) || defined(CPU_MKE02Z16VLD2) || \
    defined(CPU_MKE02Z64VLH2) || defined(CPU_MKE02Z64VQH2) || defined(CPU_MKE02Z32VLH2) || \
    defined(CPU_MKE02Z32VQH2))

    #define KE02Z2_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKE02Z2/MKE02Z2.h"
    /* Extension register definitions */
    #include "device/MKE02Z2/MKE02Z2_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKE02Z2/MKE02Z2_features.h"

#elif (defined(CPU_SKEAZN64MLC2) || defined(CPU_SKEAZN32MLC2) || defined(CPU_SKEAZN16MLC2) || \
    defined(CPU_SKEAZN64MLD2) || defined(CPU_SKEAZN32MLD2) || defined(CPU_SKEAZN16MLD2) || \
    defined(CPU_SKEAZN64MLH2) || defined(CPU_SKEAZN32MLH2))

    #define SKEAZN642_SERIES

    /* CMSIS-style register definitions */
    #include "device/SKEAZN642/SKEAZN642.h"
    /* Extension register definitions */
    #include "device/SKEAZN642/SKEAZN642_registers.h"
    /* CPU specific feature definitions */
    #include "device/SKEAZN642/SKEAZN642_features.h"

#elif (defined(CPU_MKE02Z64VLC4) || defined(CPU_MKE02Z32VLC4) || defined(CPU_MKE02Z16VLC4) || \
    defined(CPU_MKE02Z64VLD4) || defined(CPU_MKE02Z32VLD4) || defined(CPU_MKE02Z16VLD4) || \
    defined(CPU_MKE02Z64VLH4) || defined(CPU_MKE02Z64VQH4) || defined(CPU_MKE02Z32VLH4) || \
    defined(CPU_MKE02Z32VQH4))

    #define KE02Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKE02Z4/MKE02Z4.h"
    /* Extension register definitions */
    #include "device/MKE02Z4/MKE02Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKE02Z4/MKE02Z4_features.h"

#elif (defined(CPU_MKE04Z128VLD4) || defined(CPU_MKE04Z64VLD4) || defined(CPU_MKE04Z128VLK4) || \
    defined(CPU_MKE04Z64VLK4) || defined(CPU_MKE04Z128VQH4) || defined(CPU_MKE04Z64VQH4) || \
    defined(CPU_MKE04Z128VLH4) || defined(CPU_MKE04Z64VLH4))

    #define KE04Z1284_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKE04Z1284/MKE04Z1284.h"
    /* Extension register definitions */
    #include "device/MKE04Z1284/MKE04Z1284_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKE04Z1284/MKE04Z1284_features.h"

#elif (defined(CPU_MKE04Z8VFK4) || defined(CPU_MKE04Z8VTG4) || defined(CPU_MKE04Z8VWJ4))

    #define KE04Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKE04Z4/MKE04Z4.h"
    /* Extension register definitions */
    #include "device/MKE04Z4/MKE04Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKE04Z4/MKE04Z4_features.h"

#elif (defined(CPU_SKEAZN8MFK) || defined(CPU_SKEAZN8MTG))

    #define SKEAZN84_SERIES

    /* CMSIS-style register definitions */
    #include "device/SKEAZN84/SKEAZN84.h"
    /* Extension register definitions */
    #include "device/SKEAZN84/SKEAZN84_registers.h"
    /* CPU specific feature definitions */
    #include "device/SKEAZN84/SKEAZN84_features.h"

#elif (defined(CPU_MKE06Z128VLD4) || defined(CPU_MKE06Z64VLD4) || defined(CPU_MKE06Z128VLK4) || \
    defined(CPU_MKE06Z64VLK4) || defined(CPU_MKE06Z128VQH4) || defined(CPU_MKE06Z64VQH4) || \
    defined(CPU_MKE06Z128VLH4) || defined(CPU_MKE06Z64VLH4))

    #define KE06Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKE06Z4/MKE06Z4.h"
    /* Extension register definitions */
    #include "device/MKE06Z4/MKE06Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKE06Z4/MKE06Z4_features.h"

#elif (defined(CPU_MKL02Z32CAF4) || defined(CPU_MKL02Z8VFG4) || defined(CPU_MKL02Z16VFG4) || \
    defined(CPU_MKL02Z32VFG4) || defined(CPU_MKL02Z16VFK4) || defined(CPU_MKL02Z32VFK4) || \
    defined(CPU_MKL02Z16VFM4) || defined(CPU_MKL02Z32VFM4))

    #define KL02Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL02Z4/MKL02Z4.h"
    /* Extension register definitions */
    #include "device/MKL02Z4/MKL02Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL02Z4/MKL02Z4_features.h"

#elif (defined(CPU_MKL03Z32CAF4) || defined(CPU_MKL03Z8VFG4) || defined(CPU_MKL03Z16VFG4) || \
    defined(CPU_MKL03Z32VFG4) || defined(CPU_MKL03Z8VFK4) || defined(CPU_MKL03Z16VFK4) || \
    defined(CPU_MKL03Z32VFK4))

    #define KL03Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL03Z4/MKL03Z4.h"
    /* Extension register definitions */
    #include "device/MKL03Z4/MKL03Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL03Z4/MKL03Z4_features.h"

#elif (defined(CPU_MKL04Z8VFK4) || defined(CPU_MKL04Z16VFK4) || defined(CPU_MKL04Z32VFK4) || \
    defined(CPU_MKL04Z8VLC4) || defined(CPU_MKL04Z16VLC4) || defined(CPU_MKL04Z32VLC4) || \
    defined(CPU_MKL04Z8VFM4) || defined(CPU_MKL04Z16VFM4) || defined(CPU_MKL04Z32VFM4) || \
    defined(CPU_MKL04Z16VLF4) || defined(CPU_MKL04Z32VLF4))

    #define KL04Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL04Z4/MKL04Z4.h"
    /* Extension register definitions */
    #include "device/MKL04Z4/MKL04Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL04Z4/MKL04Z4_features.h"

