Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/NXP/K64FN1M0_FRDM_K64F/DeviceSupport/fsl_device_registers.h
#elif (defined(CPU_MKL05Z8VFK4) || defined(CPU_MKL05Z16VFK4) || defined(CPU_MKL05Z32VFK4) || \
    defined(CPU_MKL05Z8VLC4) || defined(CPU_MKL05Z16VLC4) || defined(CPU_MKL05Z32VLC4) || \
    defined(CPU_MKL05Z8VFM4) || defined(CPU_MKL05Z16VFM4) || defined(CPU_MKL05Z32VFM4) || \
    defined(CPU_MKL05Z16VLF4) || defined(CPU_MKL05Z32VLF4))

    #define KL05Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL05Z4/MKL05Z4.h"
    /* Extension register definitions */
    #include "device/MKL05Z4/MKL05Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL05Z4/MKL05Z4_features.h"

#elif (defined(CPU_MKL14Z32VFM4) || defined(CPU_MKL14Z64VFM4) || defined(CPU_MKL14Z32VFT4) || \
    defined(CPU_MKL14Z64VFT4) || defined(CPU_MKL14Z32VLH4) || defined(CPU_MKL14Z64VLH4) || \
    defined(CPU_MKL14Z32VLK4) || defined(CPU_MKL14Z64VLK4))

    #define KL14Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL14Z4/MKL14Z4.h"
    /* Extension register definitions */
    #include "device/MKL14Z4/MKL14Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL14Z4/MKL14Z4_features.h"

#elif (defined(CPU_MKL15Z32VFM4) || defined(CPU_MKL15Z64VFM4) || defined(CPU_MKL15Z128VFM4) || \
    defined(CPU_MKL15Z32VFT4) || defined(CPU_MKL15Z64VFT4) || defined(CPU_MKL15Z128VFT4) || \
    defined(CPU_MKL15Z32VLH4) || defined(CPU_MKL15Z64VLH4) || defined(CPU_MKL15Z128VLH4) || \
    defined(CPU_MKL15Z32VLK4) || defined(CPU_MKL15Z64VLK4) || defined(CPU_MKL15Z128VLK4))

    #define KL15Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL15Z4/MKL15Z4.h"
    /* Extension register definitions */
    #include "device/MKL15Z4/MKL15Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL15Z4/MKL15Z4_features.h"

#elif (defined(CPU_MKL16Z32VFM4) || defined(CPU_MKL16Z64VFM4) || defined(CPU_MKL16Z128VFM4) || \
    defined(CPU_MKL16Z32VFT4) || defined(CPU_MKL16Z64VFT4) || defined(CPU_MKL16Z128VFT4) || \
    defined(CPU_MKL16Z32VLH4) || defined(CPU_MKL16Z64VLH4) || defined(CPU_MKL16Z128VLH4) || \
    defined(CPU_MKL16Z256VLH4) || defined(CPU_MKL16Z256VMP4))

    #define KL16Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL16Z4/MKL16Z4.h"
    /* Extension register definitions */
    #include "device/MKL16Z4/MKL16Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL16Z4/MKL16Z4_features.h"

#elif (defined(CPU_MKL17Z128VFM4) || defined(CPU_MKL17Z256VFM4) || defined(CPU_MKL17Z128VFT4) || \
    defined(CPU_MKL17Z256VFT4) || defined(CPU_MKL17Z128VLH4) || defined(CPU_MKL17Z256VLH4) || \
    defined(CPU_MKL17Z128VMP4) || defined(CPU_MKL17Z256VMP4))

    #define KL17Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL17Z4/MKL17Z4.h"
    /* Extension register definitions */
    #include "device/MKL17Z4/MKL17Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL17Z4/MKL17Z4_features.h"

#elif (defined(CPU_MKL17Z32VDA4) || defined(CPU_MKL17Z64VDA4) || defined(CPU_MKL17Z32VFM4) || \
    defined(CPU_MKL17Z64VFM4) || defined(CPU_MKL17Z32VFT4) || defined(CPU_MKL17Z64VFT4) || \
    defined(CPU_MKL17Z32VLH4) || defined(CPU_MKL17Z64VLH4) || defined(CPU_MKL17Z32VMP4) || \
    defined(CPU_MKL17Z64VMP4))

    #define KL17Z644_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL17Z644/MKL17Z644.h"
    /* Extension register definitions */
    #include "device/MKL17Z644/MKL17Z644_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL17Z644/MKL17Z644_features.h"

#elif (defined(CPU_MKL24Z32VFM4) || defined(CPU_MKL24Z64VFM4) || defined(CPU_MKL24Z32VFT4) || \
    defined(CPU_MKL24Z64VFT4) || defined(CPU_MKL24Z32VLH4) || defined(CPU_MKL24Z64VLH4) || \
    defined(CPU_MKL24Z32VLK4) || defined(CPU_MKL24Z64VLK4))

    #define KL24Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL24Z4/MKL24Z4.h"
    /* Extension register definitions */
    #include "device/MKL24Z4/MKL24Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL24Z4/MKL24Z4_features.h"

#elif (defined(CPU_MKL25Z32VFM4) || defined(CPU_MKL25Z64VFM4) || defined(CPU_MKL25Z128VFM4) || \
    defined(CPU_MKL25Z32VFT4) || defined(CPU_MKL25Z64VFT4) || defined(CPU_MKL25Z128VFT4) || \
    defined(CPU_MKL25Z32VLH4) || defined(CPU_MKL25Z64VLH4) || defined(CPU_MKL25Z128VLH4) || \
    defined(CPU_MKL25Z32VLK4) || defined(CPU_MKL25Z64VLK4) || defined(CPU_MKL25Z128VLK4))

    #define KL25Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL25Z4/MKL25Z4.h"
    /* Extension register definitions */
    #include "device/MKL25Z4/MKL25Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL25Z4/MKL25Z4_features.h"

#elif (defined(CPU_MKL26Z32VFM4) || defined(CPU_MKL26Z64VFM4) || defined(CPU_MKL26Z128VFM4) || \
    defined(CPU_MKL26Z32VFT4) || defined(CPU_MKL26Z64VFT4) || defined(CPU_MKL26Z128VFT4) || \
    defined(CPU_MKL26Z32VLH4) || defined(CPU_MKL26Z64VLH4) || defined(CPU_MKL26Z128VLH4) || \
    defined(CPU_MKL26Z256VLH4) || defined(CPU_MKL26Z256VLK4) || defined(CPU_MKL26Z128VLL4) || \
    defined(CPU_MKL26Z256VLL4) || defined(CPU_MKL26Z128VMC4) || defined(CPU_MKL26Z256VMC4) || \
    defined(CPU_MKL26Z256VMP4))

    #define KL26Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL26Z4/MKL26Z4.h"
    /* Extension register definitions */
    #include "device/MKL26Z4/MKL26Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL26Z4/MKL26Z4_features.h"

#elif (defined(CPU_MKL27Z128VFM4) || defined(CPU_MKL27Z256VFM4) || defined(CPU_MKL27Z128VFT4) || \
    defined(CPU_MKL27Z256VFT4) || defined(CPU_MKL27Z128VLH4) || defined(CPU_MKL27Z256VLH4) || \
    defined(CPU_MKL27Z128VMP4) || defined(CPU_MKL27Z256VMP4))

    #define KL27Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL27Z4/MKL27Z4.h"
    /* Extension register definitions */
    #include "device/MKL27Z4/MKL27Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL27Z4/MKL27Z4_features.h"

#elif (defined(CPU_MKL27Z32VDA4) || defined(CPU_MKL27Z64VDA4) || defined(CPU_MKL27Z32VFM4) || \
    defined(CPU_MKL27Z64VFM4) || defined(CPU_MKL27Z32VFT4) || defined(CPU_MKL27Z64VFT4) || \
    defined(CPU_MKL27Z32VLH4) || defined(CPU_MKL27Z64VLH4) || defined(CPU_MKL27Z32VMP4) || \
    defined(CPU_MKL27Z64VMP4))

    #define KL27Z644_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL27Z644/MKL27Z644.h"
    /* Extension register definitions */
    #include "device/MKL27Z644/MKL27Z644_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL27Z644/MKL27Z644_features.h"

#elif (defined(CPU_MKL33Z128VLH4) || defined(CPU_MKL33Z256VLH4) || defined(CPU_MKL33Z128VMP4) || \
    defined(CPU_MKL33Z256VMP4))

    #define KL33Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL33Z4/MKL33Z4.h"
    /* Extension register definitions */
    #include "device/MKL33Z4/MKL33Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL33Z4/MKL33Z4_features.h"

#elif (defined(CPU_MKL34Z64VLH4) || defined(CPU_MKL34Z64VLL4))

    #define KL34Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL34Z4/MKL34Z4.h"
    /* Extension register definitions */
    #include "device/MKL34Z4/MKL34Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL34Z4/MKL34Z4_features.h"

#elif (defined(CPU_MKL36Z64VLH4) || defined(CPU_MKL36Z128VLH4) || defined(CPU_MKL36Z256VLH4) || \
    defined(CPU_MKL36Z64VLL4) || defined(CPU_MKL36Z128VLL4) || defined(CPU_MKL36Z256VLL4) || \
    defined(CPU_MKL36Z128VMC4) || defined(CPU_MKL36Z256VMC4) || defined(CPU_MKL36Z256VMP4))

    #define KL36Z4_SERIES

    /* CMSIS-style register definitions */
    #include "device/MKL36Z4/MKL36Z4.h"
    /* Extension register definitions */
    #include "device/MKL36Z4/MKL36Z4_registers.h"
    /* CPU specific feature definitions */
    #include "device/MKL36Z4/MKL36Z4_features.h"

